periodic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include "../system/initialConditions"

internalField uniform ( $meanflow 0 0);

boundaryField
{
    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    upperWall
    {
        type            symmetryPlane;
      //  value           uniform (0 0 0);
    }
    lowerActive
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    upperActive
    {
        type            symmetryPlane;
       // value           uniform (0 0 0);
    }
    inlet
    {
   		type cyclic; 
    }

    outlet
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
