periodic/0/nu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

#include "../system/initialConditions"
internalField   uniform $nu_po;

boundaryField
{

    upperWall
    {
        type            symmetryPlane;
    }

	lowerWall
	{
		type			zeroGradient;
	}

	inlet
	{
		type cyclic;
	}
    
	outlet
	{
		type 			cyclic;
	}

}

// ************************************************************************* //
