periodic/0/tau_y_field
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      tau_y_field;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $yield_str_kin;

boundaryField
{

    upperWall
    {
        type            symmetryPlane;
	//	type zeroGradient;
    }

	lowerWall
	{
		type			zeroGradient;
	}

	inlet
	{
		type 			cyclic;
	}
   
	outlet
	{
		type 			cyclic;
	}

}

// ************************************************************************* //
