periodic/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/initialConditions"

transportModel easyMB;
//transportModel Newtonian;

nu 					nu [ 0 2 -1 0 0 0 0 ] $nu_po;

magnetoBinghamCoeffs
{
	visc              visc [ 0 2 -1 0 0 0 0 ] 30e-6;
	tau_y_kin 	 tau_y_kin [ 0 2 -2 0 0 0 0 ] 20;
	Hsat 		      Hsat [ 0 -1 0 0 0 1 0 ] 2e5;
}

easyMBCoeffs
{
	visc_po        visc_po [ 0 2 -1 0 0 0 0 ] $nu_po ;
	visc_pre      visc_pre [ 0 2 -1 0 0 0 0 ] $nu_pre ;
}
// ************************************************************************* //
