periodic/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         none;
}

gradSchemes
{
    default         cellLimited leastSquares 1;

}

divSchemes
{
    default         none;
    div(phi,U)      Gauss QUICKV;
    div((nuEff*dev(T(grad(U)))))	Gauss QUICK phi;
}

laplacianSchemes
{
	default none;
	laplacian(nuEff,U) Gauss QUICK phi orthogonal;
	laplacian((1|A(U)),p) Gauss linear orthogonal;
}

interpolationSchemes
{
    default        linear;
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    default         no;
	p;
}


// ************************************************************************* //
