periodic/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object fvSolution;
}

solvers
{
  p
  {
    solver GAMG;
    tolerance 1e-12;
    relTol 1e-3;
    smoother GaussSeidel;
    nPreSweeps 0;
    nPostSweeps 2;
    cacheAgglomeration yes;
    agglomerator faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels 1;
  }
  U
  {
    solver smoothSolver;
    smoother DILUGaussSeidel;
 	preconditioner DILU;
    tolerance 1e-12;
    relTol 1e-2;
  }
  "(k|epsilon|R|nuTilda)"
  {
    solver smoothSolver;
    smoother symGaussSeidel;
    tolerance 1e-07;
    relTol 0.01;
  }
}

SIMPLE
{
  nNonOrthogonalCorrectors 0;
  residualControl
  {
    p 1e-05;
    Ux 1e-07;
    Uy 1e-03;
    "(k|epsilon|omega)" 0.001;
  }
  pRefCell 0; 
  pRefValue 0;
}

relaxationFactors
{
  fields
  {
    p 0.3;
  }
  equations
  {
    U 0.7;
    k 0.7;
    epsilon 0.7;
    R 0.7;
    nuTilda 0.7;
  }
} 	// ************************************************************************* //

