periodic/system/initialConditions
/* * * * * * * * * * * * * * * * * * * * * * * * * *
* * * * * * * * * * * * * * * * * * * * * * * * * */

meanflow 2.500000e-01;
yield_str_kin 6.250000e-02;
nu_po 1.000000e-04;
nu_pre 1.000000e-01;

#inputMode merge;
