periodic/system/sampleDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object sampleDict;
}

interpolationScheme cellPointFace;

setFormat raw;

sets
(
    x0
    {
      axis xyz;
      end (0 1e-3 0);
      nPoints 801;
      start (0 0 0);
      type uniform;

    }
  );

fields
  (
    p
    nu
    U
    wallShearStress
  ); 	// ************************************************************************* //

surfaces
  (
    wall

    {
      interpolate no;
      patches
        (
          lowerActive
        );
      type patch;

    }
    midline

    {
      interpolate no;
      patches
        (
          upperActive
        );
      type patch;

    }
    inlet

    {
      interpolate no;
      patches
        (
          inlet
        );
      type patch;

    }
    outlet

    {
      interpolate no;
      patches
        (
          outlet
        );
      type patch;

    }
  );

surfaceFormat raw;

